# Summarize Data
* 영상 7강

In [1]:
import pandas as pd
import seaborn as sns
import numpy as np

In [2]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'taxis',
 'tips',
 'titanic']

In [3]:
df = sns.load_dataset('iris')
df.shape

(150, 5)

In [4]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

##### value_counts() 숫자보다는 종류 확인하는데 더 좋은듯.

In [5]:
df['species'].value_counts()
pd.DataFrame(df['species'].value_counts())   # 우에 보다는 보기 편하다.

            species
virginica        50
versicolor       50
setosa           50

In [6]:
len(df)
df.shape      # (행, 열)로 표시
df.shape[0]    # len(df) 와 같다.

150

##### nunique() 해당 컬럼의 유니크한 값을 세어준다.

In [7]:
df['species'].nunique()

3

##### describe() 수치형 데이터의 통계값을 보여준다.

In [8]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [9]:
df.describe(include='all')   # 모든 데이터형태를 나타내준다.    df.describe? 참조.

        sepal_length  sepal_width  petal_length  petal_width    species
count     150.000000   150.000000    150.000000   150.000000        150
unique           NaN          NaN           NaN          NaN          3
top              NaN          NaN           NaN          NaN  virginica
freq             NaN          NaN           NaN          NaN         50
mean        5.843333     3.057333      3.758000     1.199333        NaN
std         0.828066     0.435866      1.765298     0.762238        NaN
min         4.300000     2.000000      1.000000     0.100000        NaN
25%         5.100000     2.800000      1.600000     0.300000        NaN
50%         5.800000     3.000000      4.350000     1.300000        NaN
75%         6.400000     3.300000      5.100000     1.800000        NaN
max         7.900000     4.400000      6.900000     2.500000        NaN

In [10]:
df.describe(include=[np.object])   # 아래 셀과 다른점을 모르겠...

<ipython-input-10-cf51e626554f>:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  df.describe(include=[np.object])   # 아래 셀과 다른점을 모르겠...

          species
count         150
unique          3
top     virginica
freq           50

In [11]:
df.describe(include=[object])

          species
count         150
unique          3
top     virginica
freq           50

In [12]:
df.describe(include=[np.number])

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

|Header|Description|
|:--|:--|
* sum() | Sum values of each object.
* count() | Count non-NA/null values of each object.
* median() | Median value of each object.
* quantile([0.25,0.75]) | Quantiles of each object.
* apply(function) | Apply function to each object.
* min() | Minimum value in each object.
* max() | Maximum value in each object.
* mean() | Mean value of each object.
* var() | Variance of each object.
* std() | Standard deviation of each object.

In [13]:
df['petal_length'].sum()  # column 을 지정하지 않으면 df 데이터의 합이 나온다. 아래 동일.

563.7

In [14]:
df['petal_length'].count()

150

In [15]:
df['petal_length'].median()

4.35

In [16]:
df['petal_length'].mean()

3.7580000000000027

##### quantile([0.25, 0.75])  사분위수 중에서 25%, 75% 에 있는 값

In [17]:
df.quantile([0.25, 0.75])
df['petal_length'].quantile([0.25, 0.75])   # 특정컬럼만 볼 수 있다.

0.25    1.6
0.75    5.1
Name: petal_length, dtype: float64

In [18]:
df['petal_length'].sum()

563.7

In [19]:
df.min()   # 최솟값
df.max()   # 최대값
df.var()   # 분산
df.std()   # 표준편차

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

### apply(function) 데이터 전처리 작업

In [20]:
df.apply(lambda x : x[0])

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
dtype: object

In [21]:
df['species_3'] = df['species'].apply(lambda x : x[:3])

In [22]:
df

     sepal_length  sepal_width  petal_length  petal_width    species species_3
0             5.1          3.5           1.4          0.2     setosa       set
1             4.9          3.0           1.4          0.2     setosa       set
2             4.7          3.2           1.3          0.2     setosa       set
3             4.6          3.1           1.5          0.2     setosa       set
4             5.0          3.6           1.4          0.2     setosa       set
..            ...          ...           ...          ...        ...       ...
145           6.7          3.0           5.2          2.3  virginica       vir
146           6.3          2.5           5.0          1.9  virginica       vir
147           6.5          3.0           5.2          2.0  virginica       vir
148           6.2          3.4           5.4          2.3  virginica       vir
149           5.9          3.0           5.1          1.8  virginica       vir

[150 rows x 6 columns]

#### 위와같은 작업을 반복할시 apply(함수) 로 작업

In [23]:
def smp(x):
    x = x[-3:]
    return x

In [24]:
df['species-3'] = df['species'].apply(smp)

In [25]:
df

,sepal_length,sepal_width,petal_length,petal_width,species,species_3,species-3
0,5.1,3.5,1.4,0.2,setosa,set,osa
1,4.9,3.0,1.4,0.2,setosa,set,osa
2,4.7,3.2,1.3,0.2,setosa,set,osa
3,4.6,3.1,1.5,0.2,setosa,set,osa
4,5.0,3.6,1.4,0.2,setosa,set,osa
...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,vir,ica
146,6.3,2.5,5.0,1.9,virginica,vir,ica
147,6.5,3.0,5.2,2.0,virginica,vir,ica
148,6.2,3.4,5.4,2.3,virginica,vir,ica
149,5.9,3.0,5.1,1.8,virginica,vir,ica